# Análisis Exploratorio

In [1]:
import pandas as pd

In [2]:
df=pd.read_table("../data/raw/Data_Fifa.txt",sep=';')

In [4]:
df.shape # dimensiones

(17954, 11)

In [5]:
df.info() # estructura

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17954 entries, 0 to 17953
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            17954 non-null  object
 1   value_euro      17699 non-null  float64
 2   wage_euro       17708 non-null  float64
 3   height_cm       17954 non-null  float64
 4   weight_kgs      17954 non-null  float64
 5   age             17954 non-null  int64
 6   nationality     17954 non-null  object
 7   overall_rating  17954 non-null  int64
 8   positions       17954 non-null  object
 9   preferred_foot  17954 non-null  object
 10  club_team       17940 non-null  object
dtypes: float64(4), int64(2), object(5)
memory usage: 1.5+ MB

¿Cuántos registros tiene el dataframe?

In [6]:
len(df.index)

17954

¿Cuántos columnas tiene el dataframe?

In [7]:
len(df.columns)

11

## Selección/Visualización de registros

Visualización de los 5 primeros registros

In [8]:
df.head(5)

,name,value_euro,wage_euro,height_cm,weight_kgs,age,nationality,overall_rating,positions,preferred_foot,club_team
0,L. Messi,110500000.0,565000.0,170.18,72.1,31,Argentina,94,"CF,RW,ST",Left,FC Barcelona
1,C. Eriksen,69500000.0,205000.0,154.94,76.2,27,Denmark,88,"CAM,RM,CM",Right,Tottenham Hotspur
2,P. Pogba,73000000.0,255000.0,190.50,83.9,25,France,88,"CM,CAM",Right,Manchester United
3,L. Insigne,62000000.0,165000.0,162.56,59.0,27,Italy,88,"LW,ST",Right,Napoli
4,K. Koulibaly,60000000.0,135000.0,187.96,88.9,27,Senegal,88,CB,Right,Napoli

Visualización de los 5 últimos registros

In [9]:
df.tail()

,name,value_euro,wage_euro,height_cm,weight_kgs,age,nationality,overall_rating,positions,preferred_foot,club_team
17949,R. McKenzie,975000.0,3000.0,175.26,74.8,25,Scotland,67,"RM,CAM,CM",Right,Kilmarnock
17950,M. Sipľak,190000.0,1000.0,182.88,79.8,23,Slovakia,59,LB,Left,Cracovia
17951,J. Bekkema,170000.0,1000.0,185.42,89.8,22,Netherlands,59,GK,Right,SC Heerenveen
17952,A. Al Yami,280000.0,4000.0,175.26,64.9,21,Saudi Arabia,59,"ST,LM",Right,Al Hilal
17953,Júnior Brumado,325000.0,2000.0,190.50,79.8,19,Brazil,59,ST,Right,FC Midtjylland

Visualización de los 5 registros al azar

In [10]:
df.sample(5)

,name,value_euro,wage_euro,height_cm,weight_kgs,age,nationality,overall_rating,positions,preferred_foot,club_team
5900,J. Talbot,90000.0,1000.0,182.88,79.8,21,Republic of Ireland,56,GK,Left,Bohemian FC
13441,D. Pineda,1400000.0,3000.0,152.40,66.2,23,El Salvador,69,"LW,RW",Left,Santa Clara
13152,A. O'Connor,925000.0,5000.0,187.96,77.1,26,Republic of Ireland,68,"CB,CDM",Right,Bradford City
14224,Jean Cléber,1800000.0,7000.0,154.94,79.8,28,Brazil,70,"CM,CDM",Right,Clube Sport Marítimo
10283,Carlos Nieto,625000.0,2000.0,152.40,73.9,22,Spain,65,"CB,LM,LB,LWB",Left,Real Zaragoza

- Numero de registros por Nacionalidades

In [11]:
df['nationality'].value_counts()

nationality
England                 1658
Germany                 1199
Spain                   1070
France                   925
Argentina                904
                        ...
Kuwait                     1
New Caledonia              1
Oman                       1
São Tomé & Príncipe        1
United Arab Emirates       1
Name: count, Length: 160, dtype: int64

- Top 5 Nacionalidades más frecuentes

In [ ]:
df['nationality'].value_counts()[0:5]

- Seleccionar las columnas name, age y preferred_foot

In [ ]:
df[["name", "age", "preferred_foot",'club_team']]

## Estadísticas Descriptivas

- Estadisticas descriptivas básicas del dataframe

In [ ]:
"""
df.describe() devuelve un nuevo DataFrame que contiene las siguientes estadísticas para las columnas numéricas del DataFrame original df:

count (conteo): El número de valores no nulos en cada columna.
mean (media): El promedio aritmético de los valores.
std (desviación estándar): Una medida de la dispersión de los valores alrededor de la media.
min (mínimo): El valor mínimo en cada columna.
25% (primer cuartil): El valor por debajo del cual se encuentra el 25% de los datos.
50% (mediana o segundo cuartil): El valor central del conjunto de datos (el valor por debajo del cual se encuentra el 50% de los datos). También es el percentil 50.
75% (tercer cuartil): El valor por debajo del cual se encuentra el 75% de los datos.
max (máximo): El valor máximo en cada columna.
"""
df.describe()

In [ ]:
# Para cada columna numerica seleccionada ('height_cm' y 'weight_kgs'), describe() calcula y muestra datos estadísticos
df[['height_cm','weight_kgs']].describe()

- Edad Promedio de los jugadores

In [ ]:
df['age'].mean()

- Edad más común de los jugadores

In [ ]:
df['age'].mode()

- Mediana de la Edad

In [ ]:
df['age'].median()

- Desviación Estandar

In [ ]:
df['wage_euro'].std()

- Mínimo

In [ ]:
df['value_euro'].min()

- Máximo

In [ ]:
df['overall_rating'].max()

In [ ]:
df[['age','wage_euro']].head()

- Suma acumulada

La siguiente linea de codigo realiza:  
- Selecciona la columna wage_euro del DataFrame df y la mantiene como un DataFrame.  
- Calcula la suma acumulada de los valores en la columna wage_euro.  
- Muestra las primeras 5 filas (por defecto) del DataFrame resultante con la suma acumulada.

In [ ]:
df[['wage_euro']].cumsum().head()

### Ordenamiento

- Ordenar de manera ascendente

In [ ]:
df.sort_values(by=['name']).head()

- Ordenar de manera descendente

In [ ]:
df.sort_values(by=['overall_rating'],ascending=False).head()

- Ordenar por age descendente y wage_euro ascendente

    - Ordena el DataFrame df primero por la columna 'age' en orden descendente y luego por la columna 'wage_euro' en orden ascendente.  
    - Muestra las primeras 5 filas del DataFrame ordenado.

In [13]:
df.sort_values(by=['age','wage_euro'],ascending=[False,True]).head()

,name,value_euro,wage_euro,height_cm,weight_kgs,age,nationality,overall_rating,positions,preferred_foot,club_team
1304,O. Pérez,160000.0,8000.0,172.72,72.1,46,Mexico,71,GK,Right,Pachuca
4865,K. Pilkington,NaN,1000.0,187.96,86.2,45,England,48,GK,Right,Cambridge United
5226,T. Warner,NaN,1000.0,193.04,83.9,44,Trinidad & Tobago,53,GK,Right,Accrington Stanley
13635,B. Nivet,NaN,3000.0,152.40,74.8,42,France,69,"CAM,CM",Right,ESTAC Troyes
9950,H. Sulaimani,NaN,5000.0,172.72,69.9,42,Saudi Arabia,64,LB,Left,Al Ahli

- Jugador más alto

In [ ]:
df.sort_values(by=['height_cm']).tail(1)

- Jugador más liviano

In [ ]:
df.sort_values(by=['weight_kgs']).head(1)

### Filtros avanzados

In [14]:
df['nationality'].value_counts()[90:100]

nationality
Haiti                10
Madagascar           10
Sierra Leone          9
Armenia               9
Kenya                 9
Syria                 8
Cyprus                8
Lithuania             8
Luxembourg            8
Trinidad & Tobago     6
Name: count, dtype: int64

In [ ]:
condicion1=df['nationality']=='Peru'
df[condicion1].sort_values(by=['overall_rating'],ascending=False)
condicion1

In [ ]:
df[df['nationality']=='Peru'].sort_values(by=['overall_rating'],ascending=False)

In [ ]:
 df [ df['age']<=20 ]

In [ ]:
df [(df['age']<=20) | (df['nationality']=='Brazil') ]

- Jugadores Franceses con rating mayor a 85

In [ ]:
df[(df['nationality']=='France') & (df['overall_rating']>85)]

- Jugadores Argentinos en Real Madrid

In [ ]:
df[(df['nationality']=='Argentina') & (df['club_team']=='Real Madrid')]

- Jugadores valorados en más de 50M que tienen entre 18 y 22 años

In [ ]:
df[ (df['age']>=18) & (df['age']<=22) & (df['value_euro']>=50000000)]

- Jugadores de Chile o México

In [ ]:
df [ (df['nationality']=='Chile') | (df['nationality']=='Mexico') ]

## Agregaciones

- Estadisticas de la variable age, agrupado por la variable club_team

In [ ]:
import numpy as np

In [ ]:
df[['club_team','age']].groupby('club_team').aggregate(['min','median', 'max','std','count'])

- Estadísticas de varias variables, agrupado por la variable nationality

In [15]:
df.groupby('nationality').aggregate({'age':'mean', 'wage_euro':'max'})

                   age  wage_euro
nationality
Afghanistan  23.333333     2000.0
Albania      25.380952    54000.0
Algeria      27.883333   205000.0
Andorra      28.000000     1000.0
Angola       26.000000    44000.0
...                ...        ...
Vietnam      24.000000     1000.0
Wales        25.446154   355000.0
Yemen        25.000000     3000.0
Zambia       23.000000     9000.0
Zimbabwe     26.538462    27000.0

[160 rows x 2 columns]